/*********************************************************************************************************
* 模块名称：
* 摘    要：
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日  
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "LED.h"
#include "stm32f10x_gpio.h"
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
 
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void ConfigLEDGPIO(void);//配置LED的GPIO
/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
static void ConfigLEDGPIO(void)
{
GPIO_InitTypeDef GPIO_InitStructure;//GPIO_InitStructure用于存放GPIO的参数
  
  //使能RCC相关时钟
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);//使能GPIOC的时钟
  GPIO_InitStructure.GPIO_Pin   =   GPIO_Pin_4;       //设置引脚
  GPIO_InitStructure.GPIO_Speed =   GPIO_Speed_50MHz; //设置I/O输出速度
  GPIO_InitStructure.GPIO_Mode  =   GPIO_Mode_Out_PP; //设置模式
  GPIO_Init(GPIOC,&GPIO_InitStructure);               //根据参数初始化LED1的GPIO
  
  GPIO_WriteBit(GPIOC,GPIO_Pin_4,Bit_SET);//将LED1默认状态设置为点亮
  
  GPIO_InitStructure.GPIO_Pin   =   GPIO_Pin_5;       //设置引脚
  GPIO_InitStructure.GPIO_Speed =   GPIO_Speed_50MHz; //设置I/O输出速度
  GPIO_InitStructure.GPIO_Mode  =   GPIO_Mode_Out_PP; //设置模式（推挽输出模式）
  GPIO_Init(GPIOC,&GPIO_InitStructure);               //根据参数初始化LED2的GPIO
  
  GPIO_WriteBit(GPIOC,GPIO_Pin_5,Bit_RESET);//将LED2默认状态设置为熄灭
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
void InitLED(void)
{
  ConfigLEDGPIO();//配置LED的GPIO
}

void LEDFlicker(u16 cnt)
{
  static u16 s_iCnt;
  s_iCnt++;
  if(s_iCnt>=cnt)
  {
    s_iCnt=0;
    //LED1状态取反
    GPIO_WriteBit(GPIOC,GPIO_Pin_4,(BitAction)(1-GPIO_ReadOutputDataBit(GPIOC,GPIO_Pin_4)));
    //LED2状态取反
    GPIO_WriteBit(GPIOC,GPIO_Pin_4,(BitAction)(1-GPIO_ReadOutputDataBit(GPIOC,GPIO_Pin_4)));
  }
}

