/*********************************************************************************************************
* 模块名称: ProcHostCmd.c
* 摘    要: 处理主机命令
* 当前版本: 1.0.0
* 作    者: Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期: 2021年03月01日 
* 内    容: 
* 注    意:                                                                   
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容: 
* 修改文件:  
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include <stdio.h>
#include <windows.h>

#include "ProcHostCmd.h"
#include "PackUnpack.h"
#include "SendDataToHost.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static unsigned int s_iTimerWave1Id;
static unsigned int s_iTimerWave2Id;

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
//定时器的中断服务函数声明，用于生成Wave1
static void __stdcall TimerISRForWave1(unsigned int uTimerID, unsigned int uMsg, unsigned long dwUser, 
                                       unsigned long dw1, unsigned long dw2);
//定时器的中断服务函数声明，用于生成Wave2
static void __stdcall TimerISRForWave2(unsigned int uTimerID, unsigned int uMsg, unsigned long dwUser, 
                                       unsigned long dw1, unsigned long dw2);

//生成Wave1的响应函数声明
static  u8 OnGenWave1(u8* pMsg); 
//生成Wave2的响应函数声明
static  u8 OnGenWave2(u8* pMsg);

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: TimerISRForWave1
* 函数功能: 定时器的中断服务函数，用于生成wave1
* 输入参数: *
* 输出参数: void
* 返 回 值: void
* 创建日期: 2021年03月01日
* 注    意: 
*********************************************************************************************************/
static void __stdcall TimerISRForWave1(unsigned int uTimerID, unsigned int uMsg, unsigned long dwUser, 
                                       unsigned long dw1, unsigned long dw2)
{
  u8 arrWave1Data[5] = {0x11, 0x11, 0x11, 0x11, 0x11};
  SendWave1ToHost(arrWave1Data);
  printf("\n");  
}

/*********************************************************************************************************
* 函数名称: TimerISRForWave2
* 函数功能: 定时器的中断服务函数，用于生成wave2
* 输入参数: *
* 输出参数: void
* 返 回 值: void
* 创建日期: 2021年03月01日
* 注    意: 
*********************************************************************************************************/
static void __stdcall TimerISRForWave2(unsigned int uTimerID, unsigned int uMsg, unsigned long dwUser, 
                                       unsigned long dw1, unsigned long dw2)
{
  u8 arrWave2Data[5] = {0x22, 0x22, 0x22, 0x22, 0x22};
  SendWave2ToHost(arrWave2Data);
  printf("\n"); 
}

/*********************************************************************************************************
* 函数名称: OnGenWave1
* 函数功能: 生成wave1
* 输入参数: pMsg
* 输出参数: void
* 返 回 值: 响应结果
* 创建日期: 2021年03月01日
* 注    意: 
*********************************************************************************************************/
static  u8 OnGenWave1(u8* pMsg) 
{
  s_iTimerWave1Id = timeSetEvent(200, 1, TimerISRForWave1, pMsg[0], TIME_PERIODIC);
  timeKillEvent(s_iTimerWave2Id);
  return(CMD_ACK_OK);
}

/*********************************************************************************************************
* 函数名称: OnGenWave2
* 函数功能: 生成wave2
* 输入参数: pMsg
* 输出参数: void
* 返 回 值: 响应结果 
* 创建日期: 2021年03月01日
* 注    意: 
*********************************************************************************************************/
static  u8 OnGenWave2(u8* pMsg) 
{
  s_iTimerWave2Id = timeSetEvent(200, 1, TimerISRForWave2, pMsg[0], TIME_PERIODIC);
  timeKillEvent(s_iTimerWave1Id);
  return(CMD_ACK_OK);
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/

/*********************************************************************************************************
* 函数名称: InitProcHostCmd
* 函数功能: 初始化该模块 
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2021年03月01日
* 注    意: 
*********************************************************************************************************/
void  InitProcHostCmd(void)
{
}

/*********************************************************************************************************
* 函数名称: ProcHostCmd
* 函数功能: 处理主机发送来的命令 
* 输入参数: recData
* 输出参数: void
* 返 回 值: void
* 创建日期: 2021年03月01日
* 注    意: 
*********************************************************************************************************/
void ProcHostCmd(u8 recData)
{
  u8 ack;
  StructPackType pack;

  while(UnPackData(recData))
  {
    pack = GetUnPackRslt();              //获取解包结果
    switch(pack.packModuleId)
    {
      case MODULE_WAVE1:
        if(CMD_GEN_WAVE1 == pack.packSecondId)
        {
		    ack = OnGenWave1(pack.arrData);
            printf("GEN_WAVE1 ACK:\n"); 
            SendAckPack(MODULE_WAVE1, CMD_GEN_WAVE1, ack);     //发送响应包
            printf("\n"); 
            printf("------WAVE1------\n");
            //printf("ID1-%d\n",s_iTimerWave1Id);
		}
        break;
      case MODULE_WAVE2:
        if(CMD_GEN_WAVE2 == pack.packSecondId)
        {
		    ack = OnGenWave2(pack.arrData);
            printf("GEN_WAVE2 ACK:\n"); 
            SendAckPack(MODULE_WAVE2, CMD_GEN_WAVE2, ack);     //发送响应包
            printf("\n"); 
            printf("------WAVE2------\n");
        }
		break;
      default:
        timeKillEvent(s_iTimerWave1Id);
        timeKillEvent(s_iTimerWave2Id);        
        break;
    }
  }   
}