/*********************************************************************************************************
* 模块名称: App.c
* 摘    要: 测试PCT协议
* 当前版本: 1.0.0
* 作    者: Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期: 2021年03月01日 
* 内    容: 
* 注    意:                                                                   
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include "PackUnpack.h"
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void PrintfDataAfterPack(u8* pData);                 //打印打包后的数据包
static void PrintfDataAfterUnpack(u8* pData, i16 packLen);  //打印解包后的数据

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
* 函数名称: PrintfDataAfterPack
* 函数功能: 打印打包后的数据包，第一个为ID，第二个为包头，第三个开始为数据，最后一个为校验和
* 输入参数: pData-待打印数据包的首地址，packLen-打印数据的个数
* 输出参数: void
* 返 回 值: void
* 创建日期: 2021年03月01日
* 注    意: 
*********************************************************************************************************/
static void PrintfDataAfterPack(u8* pData)
{
  static  u8  s_iCnt = 1;
  i16     i;
  
  printf("Packet NO.%d after packing:\n", s_iCnt);
  s_iCnt++;
  
  for( i = 0; i < 10; i++ )
  {
    printf("pData[%d] = %x \n", i, pData[i]);
  }
}

/*********************************************************************************************************
* 函数名称: PrintfDataAfterUnpack
* 函数功能: 打印解包后的数据，第一个为ID，第二个开始为数据
* 输入参数: pData-待打印数据包的首地址，packLen-打印数据的个数
* 输出参数: void
* 返 回 值: void
* 创建日期: 2021年03月01日
* 注    意: 
*********************************************************************************************************/
static void PrintfDataAfterUnpack(u8* pData, i16 packLen)
{
  static  u8  s_iCnt = 1;
  i16 i;
  
  printf("Data NO.%d after unpacking:\n", s_iCnt);
  s_iCnt++;
  
  for( i = 0; i < packLen; i++ )
  {
    printf("pData[%d] = %x \n", i, pData[i]);
  }
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/

/*********************************************************************************************************
* 函数名称: main
* 函数功能: 主函数，用于测试PackUnpack模块
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2021年03月01日
* 注    意: 
*********************************************************************************************************/
void main( void )
{
   u8  i = 0;
   u8  packGot;          //获取到数据包标志，1-获取到数据包，0-未获取到

   StructPackType  ptDataBeforePack1;    //打包前的数据包1
   StructPackType  ptDataBeforePack2;    //打包前的数据包2
 
   u8  arrDataBeforeUnpack[100] = {0x70, 0xa0, 0x82, 0x92, 0xb4, 0xd6, 0xf8, 0x90, 0x80, 0xb6, 
                                   0x22, 0x41, 
                                   0x71, 0xa0, 0x82, 0x91, 0xb3, 0xd5, 0xf7, 0x99, 0x80, 0xbc};
 
   StructPackType  ptDataAfterUnPack; //解包后的数据包，即第一个为ID，第二个开始为数据
   
   InitPackUnpack();     //初始化
 

  //对第1个数据包进行打包
  ptDataBeforePack1.packModuleId = MODULE_WAVE1;
  ptDataBeforePack1.packSecondId = DAT_WAVE1_WDATA;
  ptDataBeforePack1.arrData[0]   = 0x12;
  ptDataBeforePack1.arrData[1]   = 0x34;
  ptDataBeforePack1.arrData[2]   = 0x56;
  ptDataBeforePack1.arrData[3]   = 0x78;
  ptDataBeforePack1.arrData[4]   = 0x90;
  ptDataBeforePack1.arrData[5]   = 0x00;   
 
  if(1 == PackData(&ptDataBeforePack1))           //调用打包函数来打包数据
  {
    PrintfDataAfterPack((u8*)&ptDataBeforePack1); //打印打包
  }

  //对第2个数据包进行打包
  ptDataBeforePack2.packModuleId = MODULE_WAVE2;
  ptDataBeforePack2.packSecondId = DAT_WAVE2_WDATA;
  ptDataBeforePack2.arrData[0]   = 0x11;
  ptDataBeforePack2.arrData[1]   = 0x33;
  ptDataBeforePack2.arrData[2]   = 0x55;
  ptDataBeforePack2.arrData[3]   = 0x77;
  ptDataBeforePack2.arrData[4]   = 0x99;
  ptDataBeforePack2.arrData[5]   = 0x00;   
  
  if(1 == PackData(&ptDataBeforePack2))           //调用打包函数来打包数据
  {
    PrintfDataAfterPack((u8*)&ptDataBeforePack2); //打印打包
  }

  //依次对数据进行解包
  for(i = 0; i < 100; i++)
  {
    packGot = UnPackData(arrDataBeforeUnpack[i]);
    if(packGot > 0)                           //即获取到完整的包
    {
      ptDataAfterUnPack = GetUnPackRslt();     //获取到解包后的结果
      PrintfDataAfterUnpack((u8*)&ptDataAfterUnPack, 10); //打印解包后的结果
    }
  }

  system("pause");
}


